---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectShapeTypeOptions
source: html/0fd7faab-80f7-285d-b65a-485c996fc751.htm
---
# DirectShapeTypeOptions Methods

Compare this object with the one supplied as argument.
 Return true if the options specified by both objects are the same.